#include<iostream>
#include<string>
#include<windows.h>
#include<vector>
using namespace std;
struct Znakom
{
	string name;
	string numb;
	string Adr;
}catalog[12];
void main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	vector<string>Name{ "Генадий Андреевич Иванов", "Савин Аввакуум Ярославович", "Королёв Ермолай Павлович", "Лев Евгениевич Горшков", "Силин Валерий Александрович",
		"Петухов Юрий Ярославович", "Зимин Лука Даниилович", "Кононов Юстиниан Ефимович", "Шаров Ярослав Русланович", "Фролов Кондрат Дмитриевич", "Зайцев Михаил Александрович",
		"Киселёв Вольдемар Лукьевич" };
	vector<string>Numb{ "323-378", "819-333", "954-277", "862-153", "587-360", "775-559", "435-070", "578-181", "963-939", "340-846", "497-648", "870-213" };
	vector<string>adr{ "Город Ногинск, бульвар Ленина, 14", "город Дорохово, наб. Ленина, 28", "город Пушкино, бульвар 1905 года, 98", "город Егорьевск, пр. Балканская, 71",
		"город Дорохово, пер. Домодедовская, 81", "город Дорохово, пер. Домодедовская, 81", "город Серпухов, проезд Ленина, 96", "город Ступино, проезд Балканская, 86", "город Мытищи, пр. Славы, 81",
		"город Клин, пр. Бухарестская, 42", "город Пушкино, спуск Гагарина, 95", "город Дмитров, наб. Домодедовская, 11" };
	for (int i = 0; i < 12; i++)
	{
		catalog[i].numb = Numb[i];
		catalog[i].name = Name[i];
		catalog[i].Adr = adr[i];
	}
	string Hgf;
	int k;
	while (true)
	{
		k = 0;
		getline(cin, Hgf);
		for (int i = 0; i < 12; i++)
			if (catalog[i].name.find(Hgf, 0) < catalog[i].name.length())
				cout << catalog[i].name << " " << catalog[i].numb << " " << catalog[i].Adr << "\n";
			else
				k++;
		if (k == 12)
			cout << "\nНет в записной книжке";
	}
}

